[
    {
        "code": "E100",
        "names": "Curcumin (from turmeric)",
        "display_name": "E100 (Curcumin)",
        "type": "color (Yellow-orange)",
        "status": "e u",
        "icon": "mdi-check-circle", 
        "more_info": {
            "overview": "Turmeric is a common spice that comes from the root of Curcuma longa. It contains a chemical called curcumin, which might reduce swelling.\nTurmeric has a warm, bitter taste and is frequently used to flavor or color curry powders, mustards, butters, and cheeses. Because curcumin and other chemicals in turmeric might decrease swelling, it is often used to treat conditions that involve pain and inflammation.\nPeople commonly use turmeric for osteoarthritis. It is also used for hay fever, depression, high cholesterol, a type of liver disease, and itching, but there is no good scientific evidence to support most of these uses. There is also no good evidence to support using turmeric for COVID-19.\nDon't confuse turmeric with Javanese turmeric root or tree turmeric. Also, don't confuse it with zedoary or goldenseal, which are unrelated plants that are sometimes called turmeric.",
            "origin": "Natural colour isolated from the roots and stem of Yellowroot (Curcuma longa  and Curcuma domestica). Turmeric is the crude extract, whereas curcumin is the purified compound. It imparts the yellow colour to curry powder.",
            "daily_intake": "Turmeric has most often been used by adults in doses of up to 1.5 grams daily for up to 9 months. It is also sometimes used in mouthwashes, gels, creams, and tonics.",
            "side_effects": "No side effects known in the concentrations used in foods.\nWhen taken by mouth: Turmeric is likely safe when used short-term. Turmeric products that provide up to 8 grams of curcumin daily seem to be safe when used for up to 2 months, Also, taking up to 3 grams of turmeric daily seems to be safe when used for up to 3 months. Turmeric usually doesn't cause serious side effects. Some people can experience mild side effects such as stomach upset, nausea, dizziness, or diarrhea. These side effects are more common at higher doses.\nWhen applied to the skin: Turmeric is likely safe. It is possibly safe when turmeric is applied inside the mouth as a mouthwash.\nWhen applied into the rectum: Turmeric is possibly safe when used as an enema.",
            "uses": "Possibly Effective for\nHay fever. Taking turmeric by mouth seems to reduce hay fever symptoms such as sneezing, itching, runny nose, and congestion.\nIndigestion (dyspepsia). Taking turmeric may improve indigestion in some patients. Taking curcumin, a chemical found in turmeric, by mouth may work as well as another drug, called omeprazole.\nDepression. Most research shows that taking curcumin, a chemical found in turmeric, by mouth reduces depression symptoms in people already using an antidepressant.\nHigh levels of cholesterol or other fats (lipids) in the blood (hyperlipidemia). Taking turmeric by mouth seems to lower levels of blood fats called triglycerides. But the effects of turmeric on cholesterol levels are conflicting. Also, there are many different turmeric products available. It is not known which ones work best.\nBuildup of fat in the liver in people who drink little or no alcohol (nonalcoholic fatty liver disease or NAFLD). Taking turmeric extract by mouth reduces markers of liver injury in people who have this condition. It also seems to help prevent the build-up of more fat in the liver.\nSwelling (inflammation) and sores inside the mouth (oral mucositis). Taking curcumin, a chemical found in turmeric, by mouth, or as a lozenge or mouthwash, seems to prevent swelling and sores in the mouth during radiation treatment for cancer.\nOsteoarthritis. Taking turmeric extracts, alone or together with other herbal ingredients, can reduce pain and improve function in people with knee osteoarthritis. Turmeric might work about as well as ibuprofen for reducing pain. But it doesn't seem to work as well as another drug, called diclofenac.\nItching. Taking turmeric by mouth might reduce itching that is caused by various conditions.\nPossibly Ineffective for\nAlzheimer disease. Taking turmeric, or a chemical in turmeric called curcumin, by mouth does not seem to improve symptoms of Alzheimer disease.\nStomach ulcers. Taking turmeric by mouth does not seem to improve stomach ulcers.\nThere is interest in using turmeric for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful.",
            "interactions": "Moderate Interaction. Be cautious with this combination. \n. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs) interacts with TURMERIC. Turmeric might slow blood clotting. Taking turmeric along with medications that also slow blood clotting might increase the risk of bruising and bleeding.. \n. Medications for diabetes (Antidiabetes drugs) interacts with TURMERIC. Turmeric might lower blood sugar levels. Taking turmeric along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely.. \n. Talinolol interacts with TURMERIC. Turmeric might decrease how much talinolol the body absorbs. Taking turmeric while taking talinolol might decrease the effects of talinolol.. \n. Sulfasalazine (Azulfidine) interacts with TURMERIC. Turmeric might increase how much sulfasalazine the body absorbs. Taking turmeric while taking sulfasalazine might increase the effects and side effects of sulfasalazine.. \n. Tacrolimus (Prograf) interacts with TURMERIC. Warfarin (Coumadin) interacts with TURMERIC. Warfarin is used to slow blood clotting. Taking turmeric while taking warfarin might increase the effects of warfarin and increase the risk of bleeding and bruising.. \n. Medications for cancer (Alkylating agents) interacts with TURMERIC. Turmeric is an antioxidant. There is some concern that antioxidants might decrease the effects of some medications used for cancer. If you are taking medications for cancer, check with your healthcare provider before taking turmeric.. \n. Medications for cancer (Antitumor antibiotics) interacts with TURMERIC. Turmeric is an antioxidant. There is some concern that antioxidants might decrease the effects of medications used for cancer. If you are taking medications for cancer, check with your healthcare provider before taking turmeric.. \n. Medications for cancer (Topoisomerase I inhibitors) interacts with TURMERIC. Turmeric is an antioxidant. There is some concern that antioxidants might decrease the effectiveness of some medications used for cancers. If you are taking medications for cancer, check with your healthcare provider before taking turmeric.. \n. Amlodipine (Norvasc) interacts with TURMERIC. Turmeric might increase how much amlodipine the body absorbs. Taking turmeric while taking amlodipine might increase the effects and side effects of amlodipine.. \n. Medications that can harm the liver (Hepatotoxic drugs) interacts with TURMERIC. Turmeric might harm the liver. Some medications can also harm the liver. Taking turmeric along with a medication that can harm the liver might increase the risk of liver damage.. \n. Tamoxifen (Nolvadex) interacts with TURMERIC. Turmeric might decrease how much tamoxifen is in the body. Taking turmeric with tamoxifen might decrease the effects of tamoxifen.. \n. Methotrexate (Trexall, others) interacts with TURMERIC. Turmeric might harm the liver. Methotrexate can also harm the liver. Taking turmeric along with methotrexate might increase the risk of liver damage.. \n. Minor Interaction. Be watchful with this combination. \n. Medications changed by the liver (Cytochrome P450 1A1 (CYP1A1) substrates) interacts with TURMERIC. Some medications are changed and broken down by the liver. Turmeric might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications.. \n. Medications changed by the liver (Cytochrome P450 1A2 (CYP1A2) substrates) interacts with TURMERIC. Some medications are changed and broken down by the liver. Turmeric might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications.. \n. Medications changed by the liver (Cytochrome P450 3A4 (CYP3A4) substrates) interacts with TURMERIC. Some medications are changed and broken down by the liver. Turmeric might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications.. \n. Estrogens interacts with TURMERIC. Large amounts of turmeric might interfere with the effects of estrogen. Taking turmeric along with estrogen might decrease the effects of estrogens.. \n. Some estrogen pills include conjugated equine estrogens (Premarin), ethinyl estradiol, estradiol, and others.. \n. Norfloxacin (Noroxin) interacts with TURMERIC. Turmeric might increase how much norfloxacin the body absorbs. Taking turmeric while taking norfloxacin might increase the effects and side effects of norfloxacin.. \n. Medications moved by pumps in cells (P-Glycoprotein Substrates) interacts with TURMERIC. Some medications are moved in and out of cells by pumps. Turmeric might change how these pumps work and change how much medication stays in the body. In some cases, this might change the effects and side effects of a medication.. \n. Paclitaxel (Abraxane, Onxol) interacts with TURMERIC. Turmeric might change how much paclitaxel stays in the body. Taking turmeric while taking paclitaxel might change the effects and side effects of paclitaxel. However, this doesn't seem to be a big concern.. \n. Docetaxel (Taxotere) interacts with TURMERIC. Turmeric might increase how much docetaxel the body absorbs. Taking turmeric while taking docetaxel might increase the effects and side effects of docetaxel.. \n. Glyburide (Diabeta, others) interacts with TURMERIC. Turmeric contains curcumin. Curcumin might lower blood sugar. Glyburide is also used to lower blood sugar. Taking curcumin or turmeric along with glyburide might cause your blood sugar to go too low. Monitor your blood sugar closely. Your dose of glyburide might need to be changed.. \n. Losartan (Cozaar) interacts with TURMERIC. Taking turmeric while taking losartan might increase the effects and side effects of losartan.",
            "precautions": "When taken by mouth: Turmeric is likely safe when used short-term. Turmeric products that provide up to 8 grams of curcumin daily seem to be safe when used for up to 2 months, Also, taking up to 3 grams of turmeric daily seems to be safe when used for up to 3 months. Turmeric usually doesn't cause serious side effects. Some people can experience mild side effects such as stomach upset, nausea, dizziness, or diarrhea. These side effects are more common at higher doses.\nWhen applied to the skin: Turmeric is likely safe. It is possibly safe when turmeric is applied inside the mouth as a mouthwash.\nWhen applied into the rectum: Turmeric is possibly safe when used as an enema.\nPregnancy: Turmeric is commonly used in small amounts as a spice in foods. But it's likely unsafe to use larger amounts of turmeric as a medicine during pregnancy. It might cause a menstrual period or stimulate the uterus, putting the pregnancy at risk. Do not take medicinal amounts of turmeric if you are pregnant.\nBreast-feeding: Turmeric is commonly used in small amounts as a spice in foods. But there isn't enough reliable information to know if turmeric is safe to use in medicinal amounts during breast-feeding. Stay on the safe side and avoid use.\nGallbladder problems: Turmeric can make gallbladder problems worse. Do not use turmeric if you have gallstones or a bile duct obstruction.\nBleeding problems: Taking turmeric might slow blood clotting. This might increase the risk of bruising and bleeding in people with bleeding disorders.\nHormone-sensitive condition such as breast cancer, uterine cancer, ovarian cancer, endometriosis, or uterine fibroids: Turmeric contains a chemical called curcumin, which might act like the hormone estrogen. In theory, this might have effects on hormone-sensitive conditions. Until more is known, use cautiously if you have a condition that might be made worse by exposure to hormones.\nInfertility: Turmeric might lower testosterone levels and decrease sperm movement. This might reduce fertility. Turmeric should be used cautiously by people trying to have a baby.\nLiver disease: There is some concern that turmeric can damage the liver, especially in people who have swelling (inflammation) of the liver (hepatitis) or reduced or blocked flow of bile from the liver (cholestasis). Don't use turmeric if you have these liver problems.\nSurgery: Turmeric might slow blood clotting. It might cause extra bleeding during and after surgery. Stop using turmeric at least 2 weeks before a scheduled surgery.",
            "articles": {
                "Wikipedia": "https://en.wikipedia.org/wiki/Curcumin",
                "WebMD": "https://www.webmd.com/vitamins/ai/ingredientmono-662/turmeric",
                "PubChem": "https://pubchem.ncbi.nlm.nih.gov/compound/Curcumin",
                "PubMed": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5664031/"
            }
        }
    },
    {
        "code": "E101",
        "names": "Riboflavin (Vitamin B2), formerly called lactoflavin",
        "display_name": "E101 (Riboflavin)",
        "type": "color (Yellow-orange)",
        "status": "e u",
        "icon": "mdi-check-circle", 
        "more_info": {
            "overview": "Riboflavin is vitamin B2. It is widely found in both plant- and animal-based foods, including milk, meat, eggs, nuts, enriched flour, and green vegetables.\nRiboflavin is involved in many body processes. It's required for the proper development of the skin, lining of the digestive tract, blood cells, and brain function.\nPeople most commonly use riboflavin to prevent riboflavin deficiency, for migraine, and for high levels of homocysteine in the blood. It's also used for acne, muscle cramps, and many other conditions, but there is no good scientific evidence to support these other uses.",
            "origin": "Natural colour present in many foods such as milk, eggs, liver and vegetables. Commercially prepared from yeasts. It is also manufactured synthetically.",
            "daily_intake": "Riboflavin is an important nutrient that is found in many foods. The amount that should be consumed on a daily basis is called the recommended dietary allowance (RDA). For adult males, the RDA is 1.3 mg daily. For adult females, the RDA is 1.1 mg daily. During pregnancy, the RDA is 1.4 mg, and during breastfeeding, the RDA is 1.6 mg. Recommended amounts for children depend on age.\nRiboflavin is also available in supplements. Taking riboflavin supplements with food will increase how much the body absorbs. Speak with a healthcare provider to find out what dose might be best for a specific condition.",
            "side_effects": "No side effects known in the concentrations used in foods.\nWhen taken by mouth: Riboflavin is likely safe for most people in doses of up to 400 mg daily. In some people, riboflavin can cause the urine to turn a bright yellow color. It may also cause nausea.",
            "uses": "Effective for\nRiboflavin deficiency (ariboflavinosis). Taking riboflavin by mouth can increase levels of riboflavin in the body, helping to treat and prevent riboflavin deficiency.\nPossibly Effective for\nHigh levels of homocysteine in the blood (hyperhomocysteinemia). Taking riboflavin by mouth for 12 weeks decreases levels of homocysteine by up to 40% in some people with a specific gene type.\nMigraine. Taking high-dose riboflavin by mouth seems to modestly reduce the number and severity of migraine headaches in adults. It's unclear if it helps children.\nThere is interest in using riboflavin for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful.",
            "interactions": "Moderate Interaction\nBe cautious with this combination\nAntibiotics (Tetracycline antibiotics) interacts with RIBOFLAVIN\nRiboflavin might decrease the amount of tetracyclines that the body can absorb. Taking riboflavin along with tetracyclines might decrease the effects of tetracyclines. To avoid this interaction, take riboflavin 2 hours before or 4 hours after taking tetracyclines.",
            "precautions": "When taken by mouth: Riboflavin is likely safe for most people in doses of up to 400 mg daily. In some people, riboflavin can cause the urine to turn a bright yellow color. It may also cause nausea.\nPregnancy and breast-feeding: Riboflavin is likely safe when consumed in amounts commonly found in foods. The recommended intake is 1.4 mg daily during pregnancy and 1.6 mg daily during lactation.\nChildren: Riboflavin is likely safe for most children when consumed in amounts commonly found in foods. Higher doses of 100-200 mg daily have also been safely used.\nLiver disease: Riboflavin absorption is decreased in people with liver disease.",
            "articles": {
                "Wikipedia": "https://en.wikipedia.org/wiki/Riboflavin",
                "WebMD": "https://www.webmd.com/vitamins/ai/ingredientmono-957/riboflavin",
                "PubChem": "https://pubchem.ncbi.nlm.nih.gov/compound/Riboflavin",
                "PubMed": "https://www.ncbi.nlm.nih.gov/books/NBK525977/"
            }
        }
    }
]